data/Parm_PH_29/alpha_15/alpha_15_10929_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0473279108943568 1.00078220660841 0)
(0.141988535824134 1.00062080226748 0)
(0.236664901149957 0.998373716999994 -4.84373120263679e-18)
(0.331096869428095 0.9912298740387 -4.69835268537217e-18)
(0.424706931645726 0.97705089277624 9.33168401511651e-18)
(0.516551071023692 0.954180137532122 -4.69691709145213e-18)
(0.60590188475745 0.922964147706479 -2.35741878439658e-18)
(0.692787099626319 0.885435632082582 -3.93386361104635e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0473314189324665 1 0)
(0.141992923364246 0.999838300333132 0)
(0.236603561877925 0.997590266626776 0)
(0.330932724171946 0.990449140020243 0)
(0.424406934768588 0.976286619377568 0)
(0.516109245427258 0.953449575689817 0)
(0.605366821937763 0.922252304940528 0)
(0.69220860346827 0.884706683513606 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0455375 2.024 0)
(0.1366125 2.024 0)
(0.2276875 2.024 0)
(0.3187625 2.024 0)
(0.4098375 2.024 0)
(0.5009125 2.024 0)
(0.5919875 2.024 0)
(0.6830625 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
