data/Parm_PH_29/alpha_15/alpha_15_10929_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00746842 -0.00005234 0.00000000 0.00000719 0.00000000 0.00328030)
(0.00935230 -0.00010295 0.00000000 0.00002175 0.00000000 0.00395837)
(0.00633050 -0.00003723 0.00000000 -0.00000630 0.00000000 0.00255240)
(-0.00012879 -0.00004980 0.00000000 0.00004536 0.00000000 0.00241119)
(0.00060933 0.00013509 0.00000000 -0.00007525 0.00000000 0.00056654)
(0.00091404 -0.00036733 0.00000000 0.00031976 0.00000000 0.00350148)
(0.00174008 0.00038037 0.00000000 -0.00026357 0.00000000 0.00244054)
(0.00163613 -0.00014868 0.00000000 -0.00002029 0.00000000 0.00222833)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
